
`{"tf":"plan","lock":"false","chdir":"stacks/sample_bucket","backend-config":"backend/dev.tfbackend"}`

<!-- pre_output -->


<details><summary>Outline of changes.</summary>

```hcl
module.sample_bucket.aws_s3_bucket.sample will be created
module.sample_bucket.aws_s3_bucket_versioning.sample will be created
```
</details>

<details><summary>Plan: 2 to add, 0 to change, 0 to destroy.</br>

###### TF Sample by @dependabot[bot] via [pull_request](https://github.com/DevSecTop/TF-via-PR/actions/runs/9542165900/job/26296520033) at 2024-06-17T04:56:28Z.</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.sample_bucket.aws_s3_bucket.sample will be created
  + resource "aws_s3_bucket" "sample" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "sample"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "sample-bucket"
        }
      + tags_all                    = {
          + "Name"      = "sample-bucket"
          + "Stack"     = "sample_bucket"
          + "Terraform" = "default"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.sample_bucket.aws_s3_bucket_versioning.sample will be created
  + resource "aws_s3_bucket_versioning" "sample" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + sample_bucket_id = (known after apply)
```
</details>

<!-- post_output -->

<!-- 224backend-dev-tfbackendstacks-sample-bucketterraform-tfplan -->